sampling_cases/twoDCounterflow.orig/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fuel
    {
        type            patch;
        nFaces          20;
        startFace       7780;
    }
    air
    {
        type            patch;
        nFaces          20;
        startFace       7800;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       7820;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8000;
        startFace       8220;
    }
)

// ************************************************************************* //
